my_list = []

my_list.extend([1, 2, 3, 4, 5, 6, 7])

my_list[2], my_list[3] = my_list[3], my_list[2]

my_list.insert(4, 100)

my_list.pop(5)
my_list.pop(0)

print(my_list)


















































































# pop ფუნქცია იღებს ელემენტს სიიდან და აბრუნებს მას. მასში შეიძლება გადავცეთ ინდექსი, რომელიც მიგვანიშნებს რომელი ელემენტი ამოვიღოთ სიიდან. თუ ინდექსი არ არის მითითებული, ამოიღებს ბოლო ელემენტს.
# მაგალითად, my_list.pop(5) ამოიღებს მეხუთე ინდექსზე მდგომ ელემენტს და my_list.pop(0) ამოიღებს პირველ ინდექსზე (ნულზე) მდგომ ელემენტს.
# insert:

# insert ფუნქცია საშუალებას იძლევა სიის მითითებულ ადგილას ჩავამატოთ ახალი ელემენტი. ის ორი პარამეტრით მუშაობს: პირველი არის ინდექსი, სადაც უნდა ჩაემატოს ელემენტი, და მეორე არის თვითონ ელემენტი.
# მაგალითად, my_list.insert(4, 100) სიის მეოთხე ინდექსზე ჩაამატებს რიცხვ 100-ს.
# extend:

# extend ფუნქცია სხვა სია ან iterable ობიექტი დაამატებს არსებული სიის ბოლოს. ის საშუალებას იძლევა სია გავაფართოვოთ მრავალი ელემენტით ერთდროულად.
# მაგალითად, my_list.extend([1, 2, 3, 4, 5, 6, 7]) დაამატებს აღნიშნულ ელემენტებს ცარიელ სიას.