def even_or_odd():
    try:
        number = int(input("გთხოვთ, შეიყვანეთ რიცხვი: "))
        if number % 2 == 0:
            return f"რიცხვი {number} ლუწია."
        else:
            return f"რიცხვი {number} კენტია."
    except ValueError:
        return "გთხოვთ, შეიყვანეთ სწორი რიცხვი."

print(even_or_odd())

# try ბლოკი: აქ პროგრამა ცდილობს მომხმარებლის შეყვანილი მონაცემი გარდაქმნას მთლიან რიცხვად (int).
# თუ მომხმარებელი შეიყვანს სწორ რიცხვს: პროგრამა ამოწმებს, არის თუ არა ეს რიცხვი ლუწი (`% 2 ==

# except ValueError ბლოკი იღებს პასუხისმგებლობას try ბლოკში წარმოქმნილი ValueError შეცდომის დამუშავებაზე.